lib/src/test/resources/fixtures/list_payments_response.json

{
    "response": {
        "result": {
            "payments": [
                {
                    "accounting_systemid": "ACM123",
                    "amount": {
                        "amount": "41.94",
                        "code": "CAD"
                    },
                    "bulk_paymentid": null,
                    "clientid": 12345,
                    "creditid": null,
                    "date": "2021-04-16",
                    "from_credit": false,
                    "gateway": null,
                    "id": 235435,
                    "invoiceid": 987654,
                    "logid": 235435,
                    "note": "Some note",
                    "orderid": null,
                    "overpaymentid": null,
                    "send_client_notification": null,
                    "transactionid": null,
                    "type": "Credit Card",
                    "updated": "2021-04-17 05:29:31",
                    "vis_state": 0
                },
                {
                    "accounting_systemid": "ACM123",
                    "amount": {
                        "amount": "41.94",
                        "code": "CAD"
                    },
                    "bulk_paymentid": null,
                    "clientid": 12345,
                    "creditid": null,
                    "date": "2021-04-16",
                    "from_credit": false,
                    "gateway": null,
                    "id": 235436,
                    "invoiceid": 987654,
                    "logid": 235436,
                    "note": "Some other note",
                    "orderid": null,
                    "overpaymentid": null,
                    "send_client_notification": null,
                    "transactionid": null,
                    "type": "2Checkout",
                    "updated": "2021-04-17 05:29:31",
                    "vis_state": 0
                }
            ],
            "page": 1,
            "pages": 1,
            "per_page": 15,
            "total": 2
        }
    }
}
